src/cf/Enums/CRM_СобытияТриггеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_СобытияТриггеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьПереопределяемуюКоманду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОповещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередЗаписьюНаСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриСозданииНаСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеЗаписиНаСервере</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/CRM_ТригерыКлиент/Ext/Module.bsl
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	СтруктураОбработки = CRM_ТригерыСервер.ПолучитьОбработкуДействийДляКлиента(Форма.Объект.Ссылка, ПредопределенноеЗначение("Перечисление.CRM_СобытияТриггеров.ВыполнитьПереопределяемуюКоманду"));
	
	Если НЕ СтруктураОбработки.ОбработкаДействий = Неопределено Тогда
		Попытка
			Если СтруктураОбработки.НастройкиДействий = Неопределено Тогда
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма",,Форма);
			Иначе
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма", Новый Структура("Настройки",СтруктураОбработки.НастройкиДействий), Форма);
			КонецЕсли;
			ФормаОбработки.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры) Экспорт
	
	СтруктураОбработки = CRM_ТригерыСервер.ПолучитьОбработкуДействийДляКлиента(Форма.Объект.Ссылка, ПредопределенноеЗначение("Перечисление.CRM_СобытияТриггеров.ОбработкаОповещения"));
	
	Если НЕ СтруктураОбработки.ОбработкаДействий = Неопределено Тогда
		Попытка
			Если СтруктураОбработки.НастройкиДействий = Неопределено Тогда
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма",,Форма);
			Иначе
				ФормаОбработки = ПолучитьФорму("ВнешняяОбработка." + СтруктураОбработки.ОбработкаДействий + ".Форма", Новый Структура("Настройки",СтруктураОбработки.НастройкиДействий), Форма);
			КонецЕсли;
			ФормаОбработки.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
